In [1]:
# 라이브러리 불러오기
import pandas as pd

# 중복 데이터를 갖는 데이터프레임 만들기
df = pd.DataFrame({'c1':['a', 'a', 'b', 'a', 'b'],
                  'c2':[1, 1, 1, 2, 2],
                  'c3':[1, 1, 2, 2, 2]})
df

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [2]:
# 데이터프레임에서 중복 행을 제거 (기본값, keep='first')
df2 = df.drop_duplicates()
df2

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [3]:
# 데이터프레임에서 중복 행을 제거 (keep='last')
df3 = df.drop_duplicates(keep='last')
df3

  c1  c2  c3
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [4]:
# 데이터프레임에서 중복 행을 제거 (keep=False)
df4 = df.drop_duplicates(keep=False)
df4

  c1  c2  c3
2  b   1   2
3  a   2   2
4  b   2   2

In [5]:
# c2, c3열을 기준으로 중복 행을 제거
df5 = df.drop_duplicates(subset=['c2', 'c3'])
df5

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2

In [6]:
# c2, c3열을 기준으로 중복 행을 제거 (중복 데이터를 모두 제거)
df6 = df.drop_duplicates(subset=['c2', 'c3'], keep=False)
df6

  c1  c2  c3
2  b   1   2